[{"type":"folder","folderName":"getting started","folderPath":"main/getting started","elementName":"getting started","elementPath":"main/getting started","precursor":"main"},{"type":"file","filePath":"main/getting started/filesystem","text":"On the left, you will see the core of the application, the file explorer of the VFS ( Virtual File System )\n\nYou can create new files and/or folders with the file and folder buttons respectively. Note that the file/folder will be created next to or inside the currently selected file/folder.\nFor renaming, deleting, and copying the element path open our custom context menu by right-clicking the element you want to act on.\nThere are also drag-and-drop mechanisms. Just drag a file/folder to an unrelative folder.\n\nYou can also double-tap a folder to minimize it.","fileName":"filesystem","elementName":"filesystem","elementPath":"main/getting started/filesystem","precursor":"main/getting started"},{"type":"file","filePath":"main/getting started/textEditor","text":"Once you select a file it will open a file editor API that lets you modify its text.\nWhen you press Ctrl+S the contents will be sent to the server for further evaluation.\n\nOn the top of the editor are the open files displayed as tabs. \nIf you hover over one, a Button will appear that lets you close the file.\n\nIn the middle of the tabs and the editor, you will see the full path of the open file and a dot indicating whether there are changes pending.\n\n* WARNING if there are unsaved changes and you switch to another file, the changes WILL BE LOST. ","fileName":"textEditor","elementName":"textEditor","elementPath":"main/getting started/textEditor","precursor":"main/getting started"},{"type":"file","filePath":"main/getting started/plugins","text":"(   Coming soon!  )","fileName":"plugins","elementName":"plugins","elementPath":"main/getting started/plugins","precursor":"main/getting started"},{"type":"file","filePath":"main/getting started/settings","text":"On the bottom left corner are the settings, click the gear button.\nA window will appear where all the settings are, modify whichever you want. (auto-save is on).\nThen click the X on the top right corner, to close the settings windows. ","fileName":"settings","elementName":"settings","elementPath":"main/getting started/settings","precursor":"main/getting started"}]